In [ ]:
import pandas as pd
# Series in Pandas
df = pd.Series([1, 2, 3, 4]) #series mean single dimensional labeled array
df

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
df = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']) #use our own index in series
df

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
df = pd.Series({'a':1, 'b':2, 'c':3}) #series using dictionaru
df

a    1
b    2
c    3
dtype: int64

In [ ]:
df = pd.Series([1, 2, 3, 4, 5, 6, 7]) #Extract or slicing in series
df[2]
df[:3]
df[4:] #[start:end]
df[:3:2] #[start:end:gap]

0    1
2    3
dtype: int64

In [ ]:
# arithmetic operation in series
df = pd.Series([1, 2, 3, 4, 5, 6, 7])
df + 3
df * 3
df / 3
df == 3

0    False
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [ ]:
# dataframe in Pandas (rows and columns) 
df = pd.DataFrame({'Name':['ibad', 'ali', 'hamza'], 'Marks':[100, 50, 65]}) # we use here Key(column) & Values(rows)
df
df.shape #return rows and columns
df.head() #return starting rows
df.tail() #return ending rows
df.describe() # return statistics of table

            Marks
count    3.000000
mean    71.666667
std     25.658007
min     50.000000
25%     57.500000
50%     65.000000
75%     82.500000
max    100.000000

In [ ]:
df = pd.read_csv('/content/sample_data/california_housing_test.csv')
df.shape
df.head()
df.describe()
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [ ]:
# extracting record using iloc
df.iloc[5:11,0:3]

    longitude  latitude  housing_median_age
5     -119.56     36.51                37.0
6     -121.43     38.63                43.0
7     -120.65     35.48                19.0
8     -122.84     38.40                15.0
9     -118.02     34.08                31.0
10    -118.24     33.98                45.0

In [ ]:
# extracting record using loc
df.loc[5:11,('total_rooms','total_bedrooms')]

    total_rooms  total_bedrooms
5        1018.0           213.0
6        1009.0           225.0
7        2310.0           471.0
8        3080.0           617.0
9        2402.0           632.0
10        972.0           249.0
11        736.0           166.0

In [ ]:
# deleting column using drop axis = 1 means columns
df.drop('median_house_value', axis=1)

      longitude  latitude  ...  households  median_income
0       -122.05     37.37  ...       606.0         6.6085
1       -118.30     34.26  ...       277.0         3.5990
2       -117.81     33.78  ...       495.0         5.7934
3       -118.36     33.82  ...        11.0         6.1359
4       -119.67     36.33  ...       237.0         2.9375
...         ...       ...  ...         ...            ...
2995    -119.86     34.42  ...       607.0         1.1790
2996    -118.14     34.06  ...      1036.0         3.3906
2997    -119.70     36.30  ...       220.0         2.2895
2998    -117.12     34.10  ...        14.0         3.2708
2999    -119.63     34.42  ...       260.0         8.5608

[3000 rows x 8 columns]

In [ ]:
# deleting rows using drop axis = 0 means rows
df.drop([1, 2, 5], axis=0)

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
6       -121.43     38.63  ...         1.6641             67000.0
7       -120.65     35.48  ...         3.2250            166900.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[2997 rows x 9 columns]

In [ ]:
df.mean()
df.min()
df.max()
df.median()
df.std()

longitude                  1.994936
latitude                   2.129670
housing_median_age        12.555396
total_rooms             2155.593332
total_bedrooms           415.654368
population              1030.543012
households               365.422710
median_income              1.854512
median_house_value    113119.687470
dtype: float64

In [ ]:
# we can apply a specific functions on columns of our dataframe
def half(s):
  return s*0.5

df[['latitude']].apply(half) # here all values of latitude column are half

      latitude
0       18.685
1       17.130
2       16.890
3       16.910
4       18.165
...        ...
2995    17.210
2996    17.030
2997    18.150
2998    17.050
2999    17.210

[3000 rows x 1 columns]

In [ ]:
df['latitude'].value_counts() # count the values for all numbers

34.02    35
34.06    33
34.05    32
34.09    31
34.11    31
         ..
38.72     1
39.61     1
36.93     1
39.01     1
38.05     1
Name: latitude, Length: 587, dtype: int64

In [ ]:
df.sort_values(by='housing_median_age') # here we sort out the values for any column

      longitude  latitude  ...  median_income  median_house_value
842     -117.95     35.08  ...         4.8750            141700.0
1115    -116.95     33.86  ...         1.6250             55000.0
2117    -117.51     34.16  ...         4.1000            315000.0
2429    -117.20     33.58  ...         4.5936            174300.0
495     -122.29     37.82  ...         2.5625             60000.0
...         ...       ...  ...            ...                 ...
717     -122.27     37.86  ...         1.8447            198200.0
708     -118.21     33.97  ...         3.1901            167600.0
1826    -122.04     37.00  ...         2.9712            116600.0
754     -121.49     38.56  ...         3.6729            137800.0
1499    -122.21     37.79  ...         3.0893            125000.0

[3000 rows x 9 columns]